app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT "urls".* FROM "urls"

  def show
    begin
      @url_str = Url.make_url(params[:id])
      @url = Url.find(params[:id]) # raises an exception
---
SELECT  "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", 2]]